#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
module.function_apps.module.function_app_support_autoscaler.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.function_apps.module.function_app_user_autoscaler_02.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.cosmos.azurerm_cosmosdb_account.wallet will be updated in-place
  ~ resource "azurerm_cosmosdb_account" "wallet" {
        id                                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-01"
        name                                     = "io-p-itn-wallet-cosno-01"
        tags                                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (33 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.cosmos.azurerm_cosmosdb_sql_container.containers_01["nonces"] will be updated in-place
  ~ resource "azurerm_cosmosdb_sql_container" "containers_01" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-01/sqlDatabases/db/containers/nonces"
        name                = "nonces"
        # (6 unchanged attributes hidden)

      ~ autoscale_settings {
          ~ max_throughput = 4000 -> 2000
        }

        # (2 unchanged blocks hidden)
    }

  # module.cosmos.azurerm_cosmosdb_sql_container.containers_02["nonces"] will be created
  + resource "azurerm_cosmosdb_sql_container" "containers_02" {
      + account_name        = "io-p-itn-wallet-cosno-02"
      + database_name       = "db"
      + default_ttl         = 300
      + id                  = (known after apply)
      + name                = "nonces"
      + partition_key_path  = "/id"
      + resource_group_name = "io-p-itn-wallet-rg-01"
      + throughput          = (known after apply)

      + autoscale_settings {
          + max_throughput = 2000
        }
    }

  # module.cosmos.azurerm_cosmosdb_sql_container.containers_02["wallet-instances"] will be created
  + resource "azurerm_cosmosdb_sql_container" "containers_02" {
      + account_name        = "io-p-itn-wallet-cosno-02"
      + database_name       = "db"
      + default_ttl         = (known after apply)
      + id                  = (known after apply)
      + name                = "wallet-instances"
      + partition_key_path  = "/userId"
      + resource_group_name = "io-p-itn-wallet-rg-01"
      + throughput          = (known after apply)

      + autoscale_settings {
          + max_throughput = 4000
        }
    }

  # module.cosmos.azurerm_cosmosdb_sql_container.containers_01["leases"] has moved to module.cosmos.azurerm_cosmosdb_sql_container.leases_01
    resource "azurerm_cosmosdb_sql_container" "leases_01" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-01/sqlDatabases/db/containers/leases"
        name                = "leases"
        # (5 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 2 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
